import logo from "./logo.svg";
import "./App.css";

function App() {
  return (
    <div className="App">
      <div className="super-hidden-text">
        Hvis du kommer deg til flagget så kan du vinne premier! :-)
      </div>
      <header className="App-header">
        <img src={logo} className="App-logo" alt="logo" />
        <p>
          Edit <code>ş̸̫̣͛̀̔̏̓̎̽͊̿̒́͊͋͂̔̾̽́̀̿̓̓̂̐̔̋͛͘͘̚͝r̸̡̨̢̛̞̞̪̬͕̰̟̺̖͚̠͓͙̮̰̳̞͎̱̬̺̗̣̠͍̺̣̯̗̙̲̳͓̍͊̍͂͐̄́͂͒̍͗͑̏̓̐̈̓̈́͐̈́̀̏̔̅̌́́̈́́̓̀̿͘̕̚͜͜͝͝͝ͅͅc̴̡̧̨̨̡͔͍̫̯̣̯͔̮͙̙͔̬̺̳̻̣̼͍̦͔̫̞̦̦̭̳̖̩̹̘̲͕̹̤̯͚͎͔̜̿́̒̂́̊͌̈́̈́̓͘͝ͅ/̷̨̢̧̨͍͎̠̼͕̩͔͚̜͇̮̤̩͔̠͈̮̘̰̥͔͕̠̪̪̣̞̪͔͍̤̮͕͇̼͙̹͚̘͚̟̣͍͉̙̬̀̍̃̀̃̒̂́̓͂̈́̋͋͌̐̃̔͆͒̓̍͌̃́̒̕͜͝͠ͅͅA̷̢̢̡̛̛͕͉̠͕͍̫͉͈̰̯̣̞̽̋̾͂͊̎̔̃̓̂̇̐͑̊͆̏̿͗̆̅͊̌̌̈͌̓̈́͗̀̄̀̎͆̃̃̄͆͗͑̍̈͊́͗̔͋̿̂͌̊̕̚̚͘͝͠p̵̨̢̡̧̢̨̨̢̝͔̹̩͉͓̘̻͍̳͎̥͖͍̬̭̯͕͓͖̝͚̫͇̤̬̱̣̩̭̤͓͉̘̫̩̲͇̱͓̲̰̫̻͖̼̠̜̞̼͈̟͙͎̙̪̳̆̅́̔̃͋́̈̌͒͛̄͂͒͌͂̊̾̆̈͂͂̽́̏̍̅͐͑̃̏͒̑̽͘̚͜͝͝p̶̧̡̨̧̧̨̢̧̛̛̛͎͓͓̹̦̖̤͕̖͈̮̗̘̟̟͕̤̲͖̮̹̺̣͍̰̹͕̖͉͎̠͔̖͖̗̖͓̬͔͕̘͕͈̲̩̼̲͙̪̰̪̗̟̻̝͐̏͊̓͗̿̊̾̌̈́͑̓̑͛̄͒͊̔́͂͌͊̾̋̈́̋̽́̋̈́̽͋̔̿̐̀̒̓̈́͐̏̐͐͂̃̐̅̏́̇̏̓̃̃́̏̈́̎̓̈́̍͊͘̕̕̕̕͠͝͝͠͝͝͝ͅ.̷̫̮̝̤̪̻͓̄͋̈́͐́̉̑̂̍͊̀̾͒̈̽͊̄͐̃̉̾̕̚͝͝j̸̨̛̛̛̛̛̦̫̹͎̲̞̣̥̮̳͖̰̉̈́̐̈́̾̿̍̌͒̇́̉̒̇̓͗͐̅̑̎̅̃̀̓̽͐͂̈́̏́̄̒̇͗̋̎̽̃̎͛̔̑̾́͑̆́͆́̀́̏́͒͒̀̑̿̌͛̈́͂̊͂̍̐̕͘͜͝͝͝s̴̨̧̢̢̡̨̢̖̠̼̹̘͍̹͚͓̺͖̖̠̟̫͚̞̬̣̩̭̘͎̟̤͈͎̭̼̭͕̞̜̤̳̬͎̪̱̩͎̠͕̬̟̻͇͕͚̠̬̬͖͓͕̓͋̍̍̀͐͌̊̀̈́́͗͌̐́́͒͑̈́͂͛̓̀́̽̃̆̈̆̈̑̉̊̓̽̔͌̈́̿̎̍͆̿̃̾̈̄̅̆̈́̏̚̕̚͜͠͠͠͠͠</code> ̴̡̧̢̢̧̛̻̳̜͖̲̺̹̮͇͔̱̙̳͇̦̤̟̪̜̠̙̻̩̼̪̘̖̟̺̟͙̳̣͚̰̙̥̱͙̖̟̤̱̞̬̺̥̪͉͙̤̠̱̜̲̜̼̽͊̃̄̍̎͊̋̓̌̈̑͊͋͂̋̏͂͌̈́̿̔̊̿̀̀͗̈́̿̓́̀́̑̓̍̀̏̈́̏̎̾͒̒̓̀̉́̒̓͋͊̍̐̇̓̐͌̀̋͒̍̊̽͘͘͘͜͜͝͝͠͝͝͠͝ͅͅͅą̴̡̢̧̡̨̨̡̢̡̧̧̨̛̛̛̣̠̗̲̠̥̟͔̰͔̙̤̥̜̩̜̤̮̪̺͎̟̳̠̳̯͕̞̮̦̮̞̼̯̖͓͙͔̜͍̭̠̤̰̝̬̖͙̞̮͇͉̲̤̦̘̟̰̜̩̫̲̗̮͙̰͔̤̪̳̠̦̬͔̱͙͖͈̻̞͈̪̹̳̬͎̲̩̬̠̫̀̊̈́͂͛͗̊̃̊̂̏̆̊̇̅͗͒͂̀̅͛̒̽̍̇́̀́̿͂̓̈̿̒̐̈́͑̀̃͌̿́͊̒̈́͂̅̇́̅̆̓͛̈́̇̏̀̍̓̕̚̚̚̚͜͜͝͠͠͝ͅͅͅͅṉ̴̡̯̩̙̩͎̤̫̮̪̺̠͌̆͆͋͒̇̀̍̓̒͊̀̍͊̍̈͌̅̀͐̆̈́̒̃̓̓̑̎́̽̆̉̎̎̀̍̂̀̅̂͌͊̉̎͊́̑̿̐́̚̚̚̕̚͝͝d̸̡̨͓͙̜̭̳̠̫̙̜͍͖̲̩̘͈͖̜̝̼͓͙̬̮̤͇̣͓̜̙̏́͌͌̒͂͆̌̃̊̾̊̋̈́̽̄̂̈͛̿͘͜͜͝͠ ̴̨̢̢̢̡̧̨̧̧̢̧̛̛͓̪̘͎̗̣̱͙͍̗̩̩̗̹̘̥͚͎̭̞̟͕̹̱̮͚͙̘̜̺̫̮̳̠̳̮̙̘̩̪͓͇̘̘̘̹̙͔̜̩̬̘̝͇̻̬̼̝͎̭͚̦͎̹̳̖̖̲͕̜̺̝̙̬̘̞͉͉͎̲̯̪̘̦̗̠̬͉̜̯̤̪̫͎̭̞̖̣̩̹̅̉͆́͗̾̓̒̈́̋́̏̇͋̐̑͐̓̃́̂͊̎͊̋̄́͛̽͌̓͛̈́͂̈̐͂̋̀̐̆̅̽̎̏̈́͆̓̏̒͒̃͋̆͆̒̓̊̔͗͊͊̈̾̕͘͜͝͝͝͝͠ͅs̶̢̨̢̡̧̧̛̫͇̭̫̦̼̻̞̳̦̠͓͓̮̤͙̣̠͓̞̥̙̬̱͎̼̫̼̻̪̝̪̹̘̻̬̥̹̻̭͍͓͕̰̬̱̥̞̣̝̜̜͈̹̟̭̬͎̥̱̰̲̝̲̺̙̰̝͚̊͒̒̿̔̍̾͋̿̔̇̅̾͂̒͑͂̅̌̎̚͠͝͝͝͠á̶̡̢̢̧̨̡̢̧̨̨̡̢̢̢̨̨̹̠̮̺͍̼̜͇̰̗͔͈̩̹͚̙͇͉̪̩̭̲̣̗̫͈̯͇̗̗̮̠̹̟̙̱̱̳̭͓̮͍͇̞͚̭͕̲̟̺̭̭̩͍̙͕̤̜̙̖̪̦̺̤̤͖̦͙̖̩͈͙͍̻͍̫̺̮͇͚̦̦̟̪̝̖̦͔̣̠̟͙̤̤̭̙̯̠͙̈̃͋̋̌͆͌̿͂̽̈͊̉́̑́͂̋̆͗̅̇̌̈́̍͂́̾̎̑͆̔̂͒̐͊͗̔̽̓̉͐͐̔́͂̉̍̇͐͗͂͘̚̕̕̚͜͠͠͝ͅͅv̸̨̨̡̳̪̬͉͎̟͎̯͉͓͔̬̰̗̥͙̗̱̬̩͎̖̖̻͕̠̯̱͍̣̥̜͕̙̳̞͓̭̺̪̮̝͙͇̱̼̲̖͈̼̳̟̳̝͇̖̦̫̺́͊̅̀̒̉͐̅̄͐̐́̃͛̄̂͋͌̈́̾̀̌̉̓̅̄̐̃͘̕͘͜͠͠͝͝͝ͅe̸̛̼̾̽́̍͂̏̃͗̏̾̋̈́̀̄̉̈́͗̊̃̈̉́̅̄̋̍̀̐͛͑̃͐̓̃͆͆̍̌͗̇̀͂͐͊͌̐͌̇̈́͂̆̍̅̔̚͘͘̚̚͝͝͝͠͝͝͝ ̷̛̛̛̛͓̱͕͎̣̠̠̘̫͓̻͖̺̭͉̈́̾͑̑̄̉̈́͋̐̽̔̊̊͊̐̓́̇̌́̅͂̂͋̅̉̃̏̊̃̀̋̑͑̈́̍̃̄̈́͌̔͊̂͐͑͑̔̆͑̑̍͒̂̐̐̌̄̓͋̀̏̀͛̿͌̀̂͐̀͊̅̄̌̓̓̄͛́͆̉̀̀̏̃̃͐̈́̕͘̚̚͝͠͠͠͠͝͠͠ͅt̷̨̧̡̡̢̧̨̧̧̫͙̺͖̳͎̪̘͔̤̤̻̯̣̯̘͉̪͎̯͓̠̯̟͎̺̲̟̘̝͇͎̦͔̗͉̮͈̥͎̱̰͉̪̟̙͈̼͉̲̗̠͚̱̹̯̮͙͇̤͍̭̣̠̺͈̰̜̣̲̂̆̃͗̓̇͋̇̓̓̀̋̑͆̒̓̅̔̈́̀͌̊̚̚͠͠͠͠ͅͅͅͅo̶̢̢̡̡̡̧̧̡̨̧̡̮̫͍̺̲̭͎̖͔͓̟̗̬͔̣̙̫̹͕̯̳̱̣̙̝̺͇̻͍̪͓̘̜̭̹̬͕̗̼̼̦̩̦̟͓̤͇͖̮̣̺͖̺̼̫̤̭̟͓̘̪͚͙̗͈͖̥̲̬͖͈͚̪̙͌̅͊̎̍̀͌̒̍̀͘͜͜͠͠ ̵̨̨̨̡̨̨̢̣̼͈̬̝͇̤͈̪̯̻͖̫̘̪͚͚̤̯̥̗̣͇̰͕͔̼̻̰̹̞̥̺̤̺̖̬͇̯̙͖̱͓̱͙͚̙̤̩̝̱̞̳̙̣̲̰̜̫͎̜̈̓͋̆̅̉ͅͅŗ̷̢̨̧̧̨̛̛͙̘̭̩̻̠̺̰̝̣̦̙͈̳͔͚̠̗͉͍͔̤̣̬̰̩̯̼͔̮̺̞̹͈͓͕̲̮͎͇͚̩̦͉̩̤͔͈̻̱̮̦̥̱̯̣̘̪͉̩̪͕̭͔̈́̓͐̓̌͑̎͛͗̈́̾͆͆͒͛́́̓̉̈̆̈͒́̎̉͗̅̔̔̒̎͐͂̿̎̿̅͐͐͌͗͌̀͌͑̾̌̇͂̎́̿̎͒͘̕̕̕̕͘̕͜͝͠͝͠ͅě̶̡̢̨̧̨̢̻̣͎̳̻̠̺̜̩̯̱̬̭̯̣̩̺̞̖̣͓̞͖̦̥̭͎̟̖̜͙̺̳͗̐͑̏̈́ͅͅl̴̢̢̢̰͙̝̭͈̣̠̻͚͇͙̣̰̬̠̥̝̗̜̖̙͓̺̯̥̻̮̬̜̓͌̒̊̉̽̿̈́̿͛̎̿̽̐̔̔̿͊̿́͛̂̃͂̍͛̈͗͒̾̋͌̐͋̿̐̈̆͂͑̋̎̉̇͆͆̅̾̐͆͛̀̿̽͐̈̾̀̾͑̿̄̓̈̀̆̽͌̿̅̐͋̒͗̔̅̍̑͐̚͘̚͘̚̚͘̚͝͠͝͝ờ̵̡̡̨̧̧̡̧̧͙͉̭͙̞͎̩͙̫̼̫̝̦͎̟̪̥̟͙̼̯̮̟̙̖̞̹͉̼̲̞͎̝͍̰̣̠̓̀͐̄̓̑̊͋̏̐̿̀́̽̔̾͆͒́̈́̌͗̈́̑͑̊̽͗́̑̒́͗͋̃̾͑̀̓̀̆̀́͗̐̑̈́̂̒̀́̇̍̆̂̒̄̂́͘͘̚̚͜͝͠͠ã̸̢̛̛̜̬̳͙̭̥̙̱̺̲̼̥͔̪̞͈̜͎̞̩̝̭͚͉̗͇̣̮̐̂̊̎̎͗͗͗̀̑̎̈́́̾̃̍̅̓̿̐̑́̐́̅͆̏̉̓͆́̀̂͂̾̾̈̆̂̓̑̇̽͋̄̋̽͛͗̽͗̉͒̐̃̌̾͋͗͌́̕͘͝͠͠͠͝͝͝͝͝ď̸̢̧̨̡̧̧̧̨̧̢̛̙͍̞̳̼̩̮̼̘̻̮͕̱̜̗͕̻̮͔̹͍̫͉͙̪̲̲̘̞̖̥̫̜̭͎͙̳͖̣̲͉͈̰͓͖̥͕͎̟͍͙̀̑͊̈́̂͂͒͐͒͐̽̽̃̓̋̈́̌͒͐̉͊͋̍̈̿̈́̊̀̊̒̀̋̍̑͒͆̒̀̎̑̂̓̍͘̚͝͝͝͠ͅ.̸̧̡̡̡̨̢̢̨̨̢̡̨̢̧̨̢̧̟͙̮̜͙̖̺̺͕̦̫̪̣͈̫̱̗̰͚͕͎̺̩͔͙͔͉̻̭͓͉͔̼͔̖̤̠̙̭͈͚̟̝̦͔̹͖̪̱͈̞͙̘͇̝͔̹̙̟̠̮̬͚͔͕͉̩̭̹͙̺̩̩̻͈͚̲̩̥̠̭͖͇̫͎̰͙̩͕̜͙̰͖̘̤̟͗͌̊̍̈̌̅̄̓̃̉̒̾͌̂͋̓̍̊́̇̾̿̄͋̒̇͒̈́͗͗̅̓̋̀̐̇̓͐͂͗͑̀̈̈̀̇͂̑̈̈́̅́́̇̌̿͒̀̕͘̚͜͜͝͝͝͝͝͝ͅͅ
        </p>
        <a
          className="App-link"
          href="https://reactjs.org"
          target="_blank"
          rel="noopener noreferrer"
        >
          Learn React
        </a>
      </header>
    </div>
  );
}

export default App;
