import logo from "./images/readme.png";
import "./App.css";
import { Switch, Route, BrowserRouter as Router, Link } from "react-router-dom";
import CuriousImage from "./pages/CuriousImage";
import React from "react";
import CtfIntro from "pages/CtfIntro";
import BingoBoard from "pages/BingoBoard";
import Header from "components/Header";
import HackermanChallenge from "pages/HackermanChallenge";

function App() {
  return (
    <Router>
      <Switch>
        <Route exact path="/">
          <div className="App">
            <div className="super-hidden-text">
              Hei! Velkommen til readmes store CTF-skattejakt! Her må du bruke
              dine CTF-kunnskaper for å løse diverse oppgaver. Dersom du kommer
              deg til et flagg (en tekststreng på formatet readmeCTF
              {"{XXXXXXXXXXXXXXX}"}) så må du notere deg ned dette. Målet med
              konkurransen er å samle flest av disse flaggene. Send inn flaggene
              du finner til konkurranse[alfakrøll]abakus.no og du kan vinne fete
              premier! :-)
            </div>
            <header className="App-header">
              <img src={logo} className="App-logo" alt="logo" />
              <p>
                Edit <code>ş̸̫̣͛̀̔̏̓̎̽͊̿̒́͊͋͂̔̾̽́̀̿̓̓̂̐̔̋͛͘͘̚͝r̸̡̨̢̛̞̞̪̬͕̰̟̺̖͚̠͓͙̮̰̳̞͎̱̬̺̗̣̠͍̺̣̯̗̙̲̳͓̍͊̍͂͐̄́͂͒̍͗͑̏̓̐̈̓̈́͐̈́̀̏̔̅̌́́̈́́̓̀̿͘̕̚͜͜͝͝͝ͅͅc̴̡̧̨̨̡͔͍̫̯̣̯͔̮͙̙͔̬̺̳̻̣̼͍̦͔̫̞̦̦̭̳̖̩̹̘̲͕̹̤̯͚͎͔̜̿́̒̂́̊͌̈́̈́̓͘͝ͅ/̷̨̢̧̨͍͎̠̼͕̩͔͚̜͇̮̤̩͔̠͈̮̘̰̥͔͕̠̪̪̣̞̪͔͍̤̮͕͇̼͙̹͚̘͚̟̣͍͉̙̬̀̍̃̀̃̒̂́̓͂̈́̋͋͌̐̃̔͆͒̓̍͌̃́̒̕͜͝͠ͅͅA̷̢̢̡̛̛͕͉̠͕͍̫͉͈̰̯̣̞̽̋̾͂͊̎̔̃̓̂̇̐͑̊͆̏̿͗̆̅͊̌̌̈͌̓̈́͗̀̄̀̎͆̃̃̄͆͗͑̍̈͊́͗̔͋̿̂͌̊̕̚̚͘͝͠p̵̨̢̡̧̢̨̨̢̝͔̹̩͉͓̘̻͍̳͎̥͖͍̬̭̯͕͓͖̝͚̫͇̤̬̱̣̩̭̤͓͉̘̫̩̲͇̱͓̲̰̫̻͖̼̠̜̞̼͈̟͙͎̙̪̳̆̅́̔̃͋́̈̌͒͛̄͂͒͌͂̊̾̆̈͂͂̽́̏̍̅͐͑̃̏͒̑̽͘̚͜͝͝p̶̧̡̨̧̧̨̢̧̛̛̛͎͓͓̹̦̖̤͕̖͈̮̗̘̟̟͕̤̲͖̮̹̺̣͍̰̹͕̖͉͎̠͔̖͖̗̖͓̬͔͕̘͕͈̲̩̼̲͙̪̰̪̗̟̻̝͐̏͊̓͗̿̊̾̌̈́͑̓̑͛̄͒͊̔́͂͌͊̾̋̈́̋̽́̋̈́̽͋̔̿̐̀̒̓̈́͐̏̐͐͂̃̐̅̏́̇̏̓̃̃́̏̈́̎̓̈́̍͊͘̕̕̕̕͠͝͝͠͝͝͝ͅ.̷̫̮̝̤̪̻͓̄͋̈́͐́̉̑̂̍͊̀̾͒̈̽͊̄͐̃̉̾̕̚͝͝j̸̨̛̛̛̛̛̦̫̹͎̲̞̣̥̮̳͖̰̉̈́̐̈́̾̿̍̌͒̇́̉̒̇̓͗͐̅̑̎̅̃̀̓̽͐͂̈́̏́̄̒̇͗̋̎̽̃̎͛̔̑̾́͑̆́͆́̀́̏́͒͒̀̑̿̌͛̈́͂̊͂̍̐̕͘͜͝͝͝s̴̨̧̢̢̡̨̢̖̠̼̹̘͍̹͚͓̺͖̖̠̟̫͚̞̬̣̩̭̘͎̟̤͈͎̭̼̭͕̞̜̤̳̬͎̪̱̩͎̠͕̬̟̻͇͕͚̠̬̬͖͓͕̓͋̍̍̀͐͌̊̀̈́́͗͌̐́́͒͑̈́͂͛̓̀́̽̃̆̈̆̈̑̉̊̓̽̔͌̈́̿̎̍͆̿̃̾̈̄̅̆̈́̏̚̕̚͜͠͠͠͠͠</code> ̴̡̧̢̢̧̛̻̳̜͖̲̺̹̮͇͔̱̙̳͇̦̤̟̪̜̠̙̻̩̼̪̘̖̟̺̟͙̳̣͚̰̙̥̱͙̖̟̤̱̞̬̺̥̪͉͙̤̠̱̜̲̜̼̽͊̃̄̍̎͊̋̓̌̈̑͊͋͂̋̏͂͌̈́̿̔̊̿̀̀͗̈́̿̓́̀́̑̓̍̀̏̈́̏̎̾͒̒̓̀̉́̒̓͋͊̍̐̇̓̐͌̀̋͒̍̊̽͘͘͘͜͜͝͝͠͝͝͠͝ͅͅͅą̴̡̢̧̡̨̨̡̢̡̧̧̨̛̛̛̣̠̗̲̠̥̟͔̰͔̙̤̥̜̩̜̤̮̪̺͎̟̳̠̳̯͕̞̮̦̮̞̼̯̖͓͙͔̜͍̭̠̤̰̝̬̖͙̞̮͇͉̲̤̦̘̟̰̜̩̫̲̗̮͙̰͔̤̪̳̠̦̬͔̱͙͖͈̻̞͈̪̹̳̬͎̲̩̬̠̫̀̊̈́͂͛͗̊̃̊̂̏̆̊̇̅͗͒͂̀̅͛̒̽̍̇́̀́̿͂̓̈̿̒̐̈́͑̀̃͌̿́͊̒̈́͂̅̇́̅̆̓͛̈́̇̏̀̍̓̕̚̚̚̚͜͜͝͠͠͝ͅͅͅͅṉ̴̡̯̩̙̩͎̤̫̮̪̺̠͌̆͆͋͒̇̀̍̓̒͊̀̍͊̍̈͌̅̀͐̆̈́̒̃̓̓̑̎́̽̆̉̎̎̀̍̂̀̅̂͌͊̉̎͊́̑̿̐́̚̚̚̕̚͝͝d̸̡̨͓͙̜̭̳̠̫̙̜͍͖̲̩̘͈͖̜̝̼͓͙̬̮̤͇̣͓̜̙̏́͌͌̒͂͆̌̃̊̾̊̋̈́̽̄̂̈͛̿͘͜͜͝͠ ̴̨̢̢̢̡̧̨̧̧̢̧̛̛͓̪̘͎̗̣̱͙͍̗̩̩̗̹̘̥͚͎̭̞̟͕̹̱̮͚͙̘̜̺̫̮̳̠̳̮̙̘̩̪͓͇̘̘̘̹̙͔̜̩̬̘̝͇̻̬̼̝͎̭͚̦͎̹̳̖̖̲͕̜̺̝̙̬̘̞͉͉͎̲̯̪̘̦̗̠̬͉̜̯̤̪̫͎̭̞̖̣̩̹̅̉͆́͗̾̓̒̈́̋́̏̇͋̐̑͐̓̃́̂͊̎͊̋̄́͛̽͌̓͛̈́͂̈̐͂̋̀̐̆̅̽̎̏̈́͆̓̏̒͒̃͋̆͆̒̓̊̔͗͊͊̈̾̕͘͜͝͝͝͝͠ͅs̶̢̨̢̡̧̧̛̫͇̭̫̦̼̻̞̳̦̠͓͓̮̤͙̣̠͓̞̥̙̬̱͎̼̫̼̻̪̝̪̹̘̻̬̥̹̻̭͍͓͕̰̬̱̥̞̣̝̜̜͈̹̟̭̬͎̥̱̰̲̝̲̺̙̰̝͚̊͒̒̿̔̍̾͋̿̔̇̅̾͂̒͑͂̅̌̎̚͠͝͝͝͠á̶̡̢̢̧̨̡̢̧̨̨̡̢̢̢̨̨̹̠̮̺͍̼̜͇̰̗͔͈̩̹͚̙͇͉̪̩̭̲̣̗̫͈̯͇̗̗̮̠̹̟̙̱̱̳̭͓̮͍͇̞͚̭͕̲̟̺̭̭̩͍̙͕̤̜̙̖̪̦̺̤̤͖̦͙̖̩͈͙͍̻͍̫̺̮͇͚̦̦̟̪̝̖̦͔̣̠̟͙̤̤̭̙̯̠͙̈̃͋̋̌͆͌̿͂̽̈͊̉́̑́͂̋̆͗̅̇̌̈́̍͂́̾̎̑͆̔̂͒̐͊͗̔̽̓̉͐͐̔́͂̉̍̇͐͗͂͘̚̕̕̚͜͠͠͝ͅͅv̸̨̨̡̳̪̬͉͎̟͎̯͉͓͔̬̰̗̥͙̗̱̬̩͎̖̖̻͕̠̯̱͍̣̥̜͕̙̳̞͓̭̺̪̮̝͙͇̱̼̲̖͈̼̳̟̳̝͇̖̦̫̺́͊̅̀̒̉͐̅̄͐̐́̃͛̄̂͋͌̈́̾̀̌̉̓̅̄̐̃͘̕͘͜͠͠͝͝͝ͅe̸̛̼̾̽́̍͂̏̃͗̏̾̋̈́̀̄̉̈́͗̊̃̈̉́̅̄̋̍̀̐͛͑̃͐̓̃͆͆̍̌͗̇̀͂͐͊͌̐͌̇̈́͂̆̍̅̔̚͘͘̚̚͝͝͝͠͝͝͝ ̷̛̛̛̛͓̱͕͎̣̠̠̘̫͓̻͖̺̭͉̈́̾͑̑̄̉̈́͋̐̽̔̊̊͊̐̓́̇̌́̅͂̂͋̅̉̃̏̊̃̀̋̑͑̈́̍̃̄̈́͌̔͊̂͐͑͑̔̆͑̑̍͒̂̐̐̌̄̓͋̀̏̀͛̿͌̀̂͐̀͊̅̄̌̓̓̄͛́͆̉̀̀̏̃̃͐̈́̕͘̚̚͝͠͠͠͠͝͠͠ͅt̷̨̧̡̡̢̧̨̧̧̫͙̺͖̳͎̪̘͔̤̤̻̯̣̯̘͉̪͎̯͓̠̯̟͎̺̲̟̘̝͇͎̦͔̗͉̮͈̥͎̱̰͉̪̟̙͈̼͉̲̗̠͚̱̹̯̮͙͇̤͍̭̣̠̺͈̰̜̣̲̂̆̃͗̓̇͋̇̓̓̀̋̑͆̒̓̅̔̈́̀͌̊̚̚͠͠͠͠ͅͅͅͅo̶̢̢̡̡̡̧̧̡̨̧̡̮̫͍̺̲̭͎̖͔͓̟̗̬͔̣̙̫̹͕̯̳̱̣̙̝̺͇̻͍̪͓̘̜̭̹̬͕̗̼̼̦̩̦̟͓̤͇͖̮̣̺͖̺̼̫̤̭̟͓̘̪͚͙̗͈͖̥̲̬͖͈͚̪̙͌̅͊̎̍̀͌̒̍̀͘͜͜͠͠ ̵̨̨̨̡̨̨̢̣̼͈̬̝͇̤͈̪̯̻͖̫̘̪͚͚̤̯̥̗̣͇̰͕͔̼̻̰̹̞̥̺̤̺̖̬͇̯̙͖̱͓̱͙͚̙̤̩̝̱̞̳̙̣̲̰̜̫͎̜̈̓͋̆̅̉ͅͅŗ̷̢̨̧̧̨̛̛͙̘̭̩̻̠̺̰̝̣̦̙͈̳͔͚̠̗͉͍͔̤̣̬̰̩̯̼͔̮̺̞̹͈͓͕̲̮͎͇͚̩̦͉̩̤͔͈̻̱̮̦̥̱̯̣̘̪͉̩̪͕̭͔̈́̓͐̓̌͑̎͛͗̈́̾͆͆͒͛́́̓̉̈̆̈͒́̎̉͗̅̔̔̒̎͐͂̿̎̿̅͐͐͌͗͌̀͌͑̾̌̇͂̎́̿̎͒͘̕̕̕̕͘̕͜͝͠͝͠ͅě̶̡̢̨̧̨̢̻̣͎̳̻̠̺̜̩̯̱̬̭̯̣̩̺̞̖̣͓̞͖̦̥̭͎̟̖̜͙̺̳͗̐͑̏̈́ͅͅl̴̢̢̢̰͙̝̭͈̣̠̻͚͇͙̣̰̬̠̥̝̗̜̖̙͓̺̯̥̻̮̬̜̓͌̒̊̉̽̿̈́̿͛̎̿̽̐̔̔̿͊̿́͛̂̃͂̍͛̈͗͒̾̋͌̐͋̿̐̈̆͂͑̋̎̉̇͆͆̅̾̐͆͛̀̿̽͐̈̾̀̾͑̿̄̓̈̀̆̽͌̿̅̐͋̒͗̔̅̍̑͐̚͘̚͘̚̚͘̚͝͠͝͝ờ̵̡̡̨̧̧̡̧̧͙͉̭͙̞͎̩͙̫̼̫̝̦͎̟̪̥̟͙̼̯̮̟̙̖̞̹͉̼̲̞͎̝͍̰̣̠̓̀͐̄̓̑̊͋̏̐̿̀́̽̔̾͆͒́̈́̌͗̈́̑͑̊̽͗́̑̒́͗͋̃̾͑̀̓̀̆̀́͗̐̑̈́̂̒̀́̇̍̆̂̒̄̂́͘͘̚̚͜͝͠͠ã̸̢̛̛̜̬̳͙̭̥̙̱̺̲̼̥͔̪̞͈̜͎̞̩̝̭͚͉̗͇̣̮̐̂̊̎̎͗͗͗̀̑̎̈́́̾̃̍̅̓̿̐̑́̐́̅͆̏̉̓͆́̀̂͂̾̾̈̆̂̓̑̇̽͋̄̋̽͛͗̽͗̉͒̐̃̌̾͋͗͌́̕͘͝͠͠͠͝͝͝͝͝ď̸̢̧̨̡̧̧̧̨̧̢̛̙͍̞̳̼̩̮̼̘̻̮͕̱̜̗͕̻̮͔̹͍̫͉͙̪̲̲̘̞̖̥̫̜̭͎͙̳͖̣̲͉͈̰͓͖̥͕͎̟͍͙̀̑͊̈́̂͂͒͐͒͐̽̽̃̓̋̈́̌͒͐̉͊͋̍̈̿̈́̊̀̊̒̀̋̍̑͒͆̒̀̎̑̂̓̍͘̚͝͝͝͠ͅ.̸̧̡̡̡̨̢̢̨̨̢̡̨̢̧̨̢̧̟͙̮̜͙̖̺̺͕̦̫̪̣͈̫̱̗̰͚͕͎̺̩͔͙͔͉̻̭͓͉͔̼͔̖̤̠̙̭͈͚̟̝̦͔̹͖̪̱͈̞͙̘͇̝͔̹̙̟̠̮̬͚͔͕͉̩̭̹͙̺̩̩̻͈͚̲̩̥̠̭͖͇̫͎̰͙̩͕̜͙̰͖̘̤̟͗͌̊̍̈̌̅̄̓̃̉̒̾͌̂͋̓̍̊́̇̾̿̄͋̒̇͒̈́͗͗̅̓̋̀̐̇̓͐͂͗͑̀̈̈̀̇͂̑̈̈́̅́́̇̌̿͒̀̕͘̚͜͜͝͝͝͝͝͝ͅͅ
              </p>
              <Link to={"/ctf-intro"}>Learn React</Link>
            </header>
          </div>
        </Route>
        <Route path="/ctf-intro">
          <Header />
          <CtfIntro />
        </Route>
        <Route path="/curious-image">
          <Header />
          <CuriousImage />
        </Route>
        <Route path="/bingo">
          <Header />
          <BingoBoard />
        </Route>
        <Route path="/hackerman">
          <Header />
          <HackermanChallenge />
        </Route>
      </Switch>
    </Router>
  );
}

export default App;
